Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_ethernet_mac.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32H743_ethernet_mac.
; =======================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32H743_ethernet_mac equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// ETHERNET_MAC address definitions
// --------------------------------

typedef struct {
    volatile    uint32_t    MACCR;
    volatile    uint32_t    MACECR;
    volatile    uint32_t    MACPFR;
    volatile    uint32_t    MACWTR;
    volatile    uint32_t    MACHT0R;
    volatile    uint32_t    MACHT1R;
    volatile    uint32_t    RESERVED0[14];
    volatile    uint32_t    MACVTR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    MACVHTR;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    MACVIR;
    volatile    uint32_t    MACIVIR;
    volatile    uint32_t    RESERVED3[2];
    volatile    uint32_t    MACQTXFCR;
    volatile    uint32_t    RESERVED4[7];
    volatile    uint32_t    MACRXFCR;
    volatile    uint32_t    RESERVED5[7];
    volatile    uint32_t    MACISR;
    volatile    uint32_t    MACIER;
    volatile    uint32_t    MACRXTXSR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    MACPCSR;
    volatile    uint32_t    MACRWKPFR;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    MACLCSR;
    volatile    uint32_t    MACLTCR;
    volatile    uint32_t    MACLETR;
    volatile    uint32_t    MAC1USTCR;
    volatile    uint32_t    RESERVED8[12];
    volatile    uint32_t    MACVR;
    volatile    uint32_t    MACDR;
    volatile    uint32_t    RESERVED9[2];
    volatile    uint32_t    MACHWF1R;
    volatile    uint32_t    MACHWF2R;
    volatile    uint32_t    RESERVED10[54];
    volatile    uint32_t    MACMDIOAR;
    volatile    uint32_t    MACMDIODR;
    volatile    uint32_t    RESERVED11[62];
    volatile    uint32_t    MACA0HR;
    volatile    uint32_t    MACA0LR;
    volatile    uint32_t    MACA1HR;
    volatile    uint32_t    MACA1LR;
    volatile    uint32_t    MACA2HR;
    volatile    uint32_t    MACA2LR;
    volatile    uint32_t    MACA3HR;
    volatile    uint32_t    MACA3LR;
    volatile    uint32_t    RESERVED12[248];
    volatile    uint32_t    MMC_CONTROL;
    volatile    uint32_t    MMC_RX_INTERRUPT;
    volatile    uint32_t    MMC_TX_INTERRUPT;
    volatile    uint32_t    MMC_RX_INTERRUPT_MASK;
    volatile    uint32_t    MMC_TX_INTERRUPT_MASK;
    volatile    uint32_t    RESERVED13[14];
    volatile    uint32_t    TX_SINGLE_COLLISION_GOOD_PACKETS;
    volatile    uint32_t    TX_MULTIPLE_COLLISION_GOOD_PACKETS;
    volatile    uint32_t    RESERVED14[5];
    volatile    uint32_t    TX_PACKET_COUNT_GOOD;
    volatile    uint32_t    RESERVED15[10];
    volatile    uint32_t    RX_CRC_ERROR_PACKETS;
    volatile    uint32_t    RX_ALIGNMENT_ERROR_PACKETS;
    volatile    uint32_t    RESERVED16[10];
    volatile    uint32_t    RX_UNICAST_PACKETS_GOOD;
    volatile    uint32_t    RESERVED17[9];
    volatile    uint32_t    TX_LPI_USEC_CNTR;
    volatile    uint32_t    TX_LPI_TRAN_CNTR;
    volatile    uint32_t    RX_LPI_USEC_CNTR;
    volatile    uint32_t    RX_LPI_TRAN_CNTR;
    volatile    uint32_t    RESERVED18[65];
    volatile    uint32_t    MACL3L4C0R;
    volatile    uint32_t    MACL4A0R;
    volatile    uint32_t    RESERVED19[2];
    volatile    uint32_t    MACL3A00R;
    volatile    uint32_t    MACL3A10R;
    volatile    uint32_t    MACL3A20;
    volatile    uint32_t    MACL3A30;
    volatile    uint32_t    RESERVED20[4];
    volatile    uint32_t    MACL3L4C1R;
    volatile    uint32_t    MACL4A1R;
    volatile    uint32_t    RESERVED21[2];
    volatile    uint32_t    MACL3A01R;
    volatile    uint32_t    MACL3A11R;
    volatile    uint32_t    MACL3A21R;
    volatile    uint32_t    MACL3A31R;
    volatile    uint32_t    RESERVED22[100];
    volatile    uint32_t    MACARPAR;
    volatile    uint32_t    RESERVED23[7];
    volatile    uint32_t    MACTSCR;
    volatile    uint32_t    MACSSIR;
    volatile    uint32_t    MACSTSR;
    volatile    uint32_t    MACSTNR;
    volatile    uint32_t    MACSTSUR;
    volatile    uint32_t    MACSTNUR;
    volatile    uint32_t    MACTSAR;
    volatile    uint32_t    RESERVED24;
    volatile    uint32_t    MACTSSR;
    volatile    uint32_t    RESERVED25[3];
    volatile    uint32_t    MACTXTSSNR;
    volatile    uint32_t    MACTXTSSSR;
    volatile    uint32_t    RESERVED26[2];
    volatile    uint32_t    MACACR;
    volatile    uint32_t    RESERVED27;
    volatile    uint32_t    MACATSNR;
    volatile    uint32_t    MACATSSR;
    volatile    uint32_t    MACTSIACR;
    volatile    uint32_t    MACTSEACR;
    volatile    uint32_t    MACTSICNR;
    volatile    uint32_t    MACTSECNR;
    volatile    uint32_t    RESERVED28[4];
    volatile    uint32_t    MACPPSCR;
    volatile    uint32_t    RESERVED29[3];
    volatile    uint32_t    MACPPSTTSR;
    volatile    uint32_t    MACPPSTTNR;
    volatile    uint32_t    MACPPSIR;
    volatile    uint32_t    MACPPSWR;
    volatile    uint32_t    RESERVED30[12];
    volatile    uint32_t    MACPOCR;
    volatile    uint32_t    MACSPI0R;
    volatile    uint32_t    MACSPI1R;
    volatile    uint32_t    MACSPI2R;
    volatile    uint32_t    MACLMIR;
} ETHERNET_MAC_TypeDef;

#ifdef __cplusplus
#define ETHERNET_MAC    reinterpret_cast<ETHERNET_MAC_TypeDef *>(0x40028000U)

#else
#define ETHERNET_MAC    ((ETHERNET_MAC_TypeDef *)0x40028000U)
#endif

// MACCR Configuration

