Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_ethernet_mac.h
// MACVHTR Configuration

#define ETHERNET_MAC_MACVHTR_VLHT                                       (0xFFFFU<<0)
#define ETHERNET_MAC_MACVHTR_VLHT_0                                     (0x1U<<0)

// MACVIR Configuration

#define ETHERNET_MAC_MACVIR_VLTI                                        (0x1U<<20)
#define ETHERNET_MAC_MACVIR_CSVL                                        (0x1U<<19)
#define ETHERNET_MAC_MACVIR_VLP                                         (0x1U<<18)
#define ETHERNET_MAC_MACVIR_VLC                                         (0x3U<<16)
#define ETHERNET_MAC_MACVIR_VLC_0                                       (0x1U<<16)
#define ETHERNET_MAC_MACVIR_VLT                                         (0xFFFFU<<0)
#define ETHERNET_MAC_MACVIR_VLT_0                                       (0x1U<<0)

// MACIVIR Configuration

#define ETHERNET_MAC_MACIVIR_VLTI                                       (0x1U<<20)
#define ETHERNET_MAC_MACIVIR_CSVL                                       (0x1U<<19)
#define ETHERNET_MAC_MACIVIR_VLP                                        (0x1U<<18)
#define ETHERNET_MAC_MACIVIR_VLC                                        (0x3U<<16)
#define ETHERNET_MAC_MACIVIR_VLC_0                                      (0x1U<<16)
#define ETHERNET_MAC_MACIVIR_VLT                                        (0xFFFFU<<0)
#define ETHERNET_MAC_MACIVIR_VLT_0                                      (0x1U<<0)

// MACQTXFCR Configuration

#define ETHERNET_MAC_MACQTXFCR_PT                                       (0xFFFFU<<16)
#define ETHERNET_MAC_MACQTXFCR_PT_0                                     (0x1U<<16)
#define ETHERNET_MAC_MACQTXFCR_DZPQ                                     (0x1U<<7)
#define ETHERNET_MAC_MACQTXFCR_PLT                                      (0x7U<<4)
#define ETHERNET_MAC_MACQTXFCR_PLT_0                                    (0x1U<<4)
#define ETHERNET_MAC_MACQTXFCR_TFE                                      (0x1U<<1)
#define ETHERNET_MAC_MACQTXFCR_FCB_BPA                                  (0x1U<<0)

// MACRXFCR Configuration

#define ETHERNET_MAC_MACRXFCR_UP                                        (0x1U<<1)
#define ETHERNET_MAC_MACRXFCR_RFE                                       (0x1U<<0)

// MACISR Configuration

#define ETHERNET_MAC_MACISR_RXSTSIS                                     (0x1U<<14)
#define ETHERNET_MAC_MACISR_TXSTSIS                                     (0x1U<<13)
#define ETHERNET_MAC_MACISR_TSIS                                        (0x1U<<12)
#define ETHERNET_MAC_MACISR_MMCTXIS                                     (0x1U<<10)
#define ETHERNET_MAC_MACISR_MMCRXIS                                     (0x1U<<9)
#define ETHERNET_MAC_MACISR_MMCIS                                       (0x1U<<8)
#define ETHERNET_MAC_MACISR_LPIIS                                       (0x1U<<5)
#define ETHERNET_MAC_MACISR_PMTIS                                       (0x1U<<4)
#define ETHERNET_MAC_MACISR_PHYIS                                       (0x1U<<3)

// MACIER Configuration

#define ETHERNET_MAC_MACIER_RXSTSIE                                     (0x1U<<14)
#define ETHERNET_MAC_MACIER_TXSTSIE                                     (0x1U<<13)
#define ETHERNET_MAC_MACIER_TSIE                                        (0x1U<<12)
#define ETHERNET_MAC_MACIER_LPIIE                                       (0x1U<<5)
#define ETHERNET_MAC_MACIER_PMTIE                                       (0x1U<<4)
#define ETHERNET_MAC_MACIER_PHYIE                                       (0x1U<<3)

// MACRXTXSR Configuration

#define ETHERNET_MAC_MACRXTXSR_RWT                                      (0x1U<<8)
#define ETHERNET_MAC_MACRXTXSR_EXCOL                                    (0x1U<<5)
#define ETHERNET_MAC_MACRXTXSR_LCOL                                     (0x1U<<4)
#define ETHERNET_MAC_MACRXTXSR_EXDEF                                    (0x1U<<3)
#define ETHERNET_MAC_MACRXTXSR_LCARR                                    (0x1U<<2)
#define ETHERNET_MAC_MACRXTXSR_NCARR                                    (0x1U<<1)
#define ETHERNET_MAC_MACRXTXSR_TJT                                      (0x1U<<0)

// MACPCSR Configuration

#define ETHERNET_MAC_MACPCSR_RWKFILTRST                                 (0x1U<<31)
#define ETHERNET_MAC_MACPCSR_RWKPTR                                     (0x1FU<<24)
#define ETHERNET_MAC_MACPCSR_RWKPTR_0                                   (0x1U<<24)
#define ETHERNET_MAC_MACPCSR_RWKPFE                                     (0x1U<<10)
#define ETHERNET_MAC_MACPCSR_GLBLUCAST                                  (0x1U<<9)
#define ETHERNET_MAC_MACPCSR_RWKPRCVD                                   (0x1U<<6)
#define ETHERNET_MAC_MACPCSR_MGKPRCVD                                   (0x1U<<5)
#define ETHERNET_MAC_MACPCSR_RWKPKTEN                                   (0x1U<<2)
#define ETHERNET_MAC_MACPCSR_MGKPKTEN                                   (0x1U<<1)
#define ETHERNET_MAC_MACPCSR_PWRDWN                                     (0x1U<<0)

// MACRWKPFR Configuration

#define ETHERNET_MAC_MACRWKPFR_MACRWKPFR                                (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACRWKPFR_MACRWKPFR_0                              (0x1U<<0)

// MACLCSR Configuration

#define ETHERNET_MAC_MACLCSR_LPITE                                      (0x1U<<20)
#define ETHERNET_MAC_MACLCSR_LPITXA                                     (0x1U<<19)
#define ETHERNET_MAC_MACLCSR_PLSEN                                      (0x1U<<18)
#define ETHERNET_MAC_MACLCSR_PLS                                        (0x1U<<17)
#define ETHERNET_MAC_MACLCSR_LPIEN                                      (0x1U<<16)
#define ETHERNET_MAC_MACLCSR_RLPIST                                     (0x1U<<9)
#define ETHERNET_MAC_MACLCSR_TLPIST                                     (0x1U<<8)
#define ETHERNET_MAC_MACLCSR_RLPIEX                                     (0x1U<<3)
#define ETHERNET_MAC_MACLCSR_RLPIEN                                     (0x1U<<2)
#define ETHERNET_MAC_MACLCSR_TLPIEX                                     (0x1U<<1)
#define ETHERNET_MAC_MACLCSR_TLPIEN                                     (0x1U<<0)

