Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_ethernet_mac.h
// MACLTCR Configuration

#define ETHERNET_MAC_MACLTCR_LST                                        (0x3FFU<<16)
#define ETHERNET_MAC_MACLTCR_LST_0                                      (0x1U<<16)
#define ETHERNET_MAC_MACLTCR_TWT                                        (0xFFFFU<<0)
#define ETHERNET_MAC_MACLTCR_TWT_0                                      (0x1U<<0)

// MACLETR Configuration

#define ETHERNET_MAC_MACLETR_LPIET                                      (0x1FFFFU<<0)
#define ETHERNET_MAC_MACLETR_LPIET_0                                    (0x1U<<0)

// MAC1USTCR Configuration

#define ETHERNET_MAC_MAC1USTCR_TIC_1US_CNTR                             (0xFFFU<<0)
#define ETHERNET_MAC_MAC1USTCR_TIC_1US_CNTR_0                           (0x1U<<0)

// MACVR Configuration

#define ETHERNET_MAC_MACVR_USERVER                                      (0xFFU<<8)
#define ETHERNET_MAC_MACVR_USERVER_0                                    (0x1U<<8)
#define ETHERNET_MAC_MACVR_SNPSVER                                      (0xFFU<<0)
#define ETHERNET_MAC_MACVR_SNPSVER_0                                    (0x1U<<0)

// MACDR Configuration

#define ETHERNET_MAC_MACDR_TFCSTS                                       (0x3U<<17)
#define ETHERNET_MAC_MACDR_TFCSTS_0                                     (0x1U<<17)
#define ETHERNET_MAC_MACDR_TPESTS                                       (0x1U<<16)
#define ETHERNET_MAC_MACDR_RFCFCSTS                                     (0x3U<<1)
#define ETHERNET_MAC_MACDR_RFCFCSTS_0                                   (0x1U<<1)
#define ETHERNET_MAC_MACDR_RPESTS                                       (0x1U<<0)

// MACHWF1R Configuration

#define ETHERNET_MAC_MACHWF1R_L3L4FNUM                                  (0xFU<<27)
#define ETHERNET_MAC_MACHWF1R_L3L4FNUM_0                                (0x1U<<27)
#define ETHERNET_MAC_MACHWF1R_HASHTBLSZ                                 (0x3U<<24)
#define ETHERNET_MAC_MACHWF1R_HASHTBLSZ_0                               (0x1U<<24)
#define ETHERNET_MAC_MACHWF1R_AVSEL                                     (0x1U<<20)
#define ETHERNET_MAC_MACHWF1R_DBGMEMA                                   (0x1U<<19)
#define ETHERNET_MAC_MACHWF1R_TSOEN                                     (0x1U<<18)
#define ETHERNET_MAC_MACHWF1R_SPHEN                                     (0x1U<<17)
#define ETHERNET_MAC_MACHWF1R_DCBEN                                     (0x1U<<16)
#define ETHERNET_MAC_MACHWF1R_ADDR64                                    (0x3U<<14)
#define ETHERNET_MAC_MACHWF1R_ADDR64_0                                  (0x1U<<14)
#define ETHERNET_MAC_MACHWF1R_ADVTHWORD                                 (0x1U<<13)
#define ETHERNET_MAC_MACHWF1R_PTOEN                                     (0x1U<<12)
#define ETHERNET_MAC_MACHWF1R_OSTEN                                     (0x1U<<11)
#define ETHERNET_MAC_MACHWF1R_TXFIFOSIZE                                (0x1FU<<6)
#define ETHERNET_MAC_MACHWF1R_TXFIFOSIZE_0                              (0x1U<<6)
#define ETHERNET_MAC_MACHWF1R_RXFIFOSIZE                                (0x1FU<<0)
#define ETHERNET_MAC_MACHWF1R_RXFIFOSIZE_0                              (0x1U<<0)

// MACHWF2R Configuration

#define ETHERNET_MAC_MACHWF2R_AUXSNAPNUM                                (0x7U<<28)
#define ETHERNET_MAC_MACHWF2R_AUXSNAPNUM_0                              (0x1U<<28)
#define ETHERNET_MAC_MACHWF2R_PPSOUTNUM                                 (0x7U<<24)
#define ETHERNET_MAC_MACHWF2R_PPSOUTNUM_0                               (0x1U<<24)
#define ETHERNET_MAC_MACHWF2R_TXCHCNT                                   (0xFU<<18)
#define ETHERNET_MAC_MACHWF2R_TXCHCNT_0                                 (0x1U<<18)
#define ETHERNET_MAC_MACHWF2R_RXCHCNT                                   (0xFU<<12)
#define ETHERNET_MAC_MACHWF2R_RXCHCNT_0                                 (0x1U<<12)
#define ETHERNET_MAC_MACHWF2R_TXQCNT                                    (0xFU<<6)
#define ETHERNET_MAC_MACHWF2R_TXQCNT_0                                  (0x1U<<6)
#define ETHERNET_MAC_MACHWF2R_RXQCNT                                    (0xFU<<0)
#define ETHERNET_MAC_MACHWF2R_RXQCNT_0                                  (0x1U<<0)

// MACMDIOAR Configuration

#define ETHERNET_MAC_MACMDIOAR_PSE                                      (0x1U<<27)
#define ETHERNET_MAC_MACMDIOAR_BTB                                      (0x1U<<26)
#define ETHERNET_MAC_MACMDIOAR_PA                                       (0x1FU<<21)
#define ETHERNET_MAC_MACMDIOAR_PA_0                                     (0x1U<<21)
#define ETHERNET_MAC_MACMDIOAR_RDA                                      (0x1FU<<16)
#define ETHERNET_MAC_MACMDIOAR_RDA_0                                    (0x1U<<16)
#define ETHERNET_MAC_MACMDIOAR_NTC                                      (0x7U<<12)
#define ETHERNET_MAC_MACMDIOAR_NTC_0                                    (0x1U<<12)
#define ETHERNET_MAC_MACMDIOAR_CR                                       (0xFU<<8)
#define ETHERNET_MAC_MACMDIOAR_CR_0                                     (0x1U<<8)
#define ETHERNET_MAC_MACMDIOAR_SKAP                                     (0x1U<<4)
#define ETHERNET_MAC_MACMDIOAR_GOC                                      (0x3U<<2)
#define ETHERNET_MAC_MACMDIOAR_GOC_0                                    (0x1U<<2)
#define ETHERNET_MAC_MACMDIOAR_C45E                                     (0x1U<<1)
#define ETHERNET_MAC_MACMDIOAR_MB                                       (0x1U<<0)

// MACMDIODR Configuration

#define ETHERNET_MAC_MACMDIODR_RA                                       (0xFFFFU<<16)
#define ETHERNET_MAC_MACMDIODR_RA_0                                     (0x1U<<16)
#define ETHERNET_MAC_MACMDIODR_MD                                       (0xFFFFU<<0)
#define ETHERNET_MAC_MACMDIODR_MD_0                                     (0x1U<<0)

// MACA0HR Configuration

#define ETHERNET_MAC_MACA0HR_AE                                         (0x1U<<31)
#define ETHERNET_MAC_MACA0HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MAC_MACA0HR_ADDRHI_0                                   (0x1U<<0)

