Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_ethernet_mac.h
// MACA0LR Configuration

#define ETHERNET_MAC_MACA0LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACA0LR_ADDRLO_0                                   (0x1U<<0)

// MACA1HR Configuration

#define ETHERNET_MAC_MACA1HR_AE                                         (0x1U<<31)
#define ETHERNET_MAC_MACA1HR_SA                                         (0x1U<<30)
#define ETHERNET_MAC_MACA1HR_MBC                                        (0x3FU<<24)
#define ETHERNET_MAC_MACA1HR_MBC_0                                      (0x1U<<24)
#define ETHERNET_MAC_MACA1HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MAC_MACA1HR_ADDRHI_0                                   (0x1U<<0)

// MACA1LR Configuration

#define ETHERNET_MAC_MACA1LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACA1LR_ADDRLO_0                                   (0x1U<<0)

// MACA2HR Configuration

#define ETHERNET_MAC_MACA2HR_AE                                         (0x1U<<31)
#define ETHERNET_MAC_MACA2HR_SA                                         (0x1U<<30)
#define ETHERNET_MAC_MACA2HR_MBC                                        (0x3FU<<24)
#define ETHERNET_MAC_MACA2HR_MBC_0                                      (0x1U<<24)
#define ETHERNET_MAC_MACA2HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MAC_MACA2HR_ADDRHI_0                                   (0x1U<<0)

// MACA2LR Configuration

#define ETHERNET_MAC_MACA2LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACA2LR_ADDRLO_0                                   (0x1U<<0)

// MACA3HR Configuration

#define ETHERNET_MAC_MACA3HR_AE                                         (0x1U<<31)
#define ETHERNET_MAC_MACA3HR_SA                                         (0x1U<<30)
#define ETHERNET_MAC_MACA3HR_MBC                                        (0x3FU<<24)
#define ETHERNET_MAC_MACA3HR_MBC_0                                      (0x1U<<24)
#define ETHERNET_MAC_MACA3HR_ADDRHI                                     (0xFFFFU<<0)
#define ETHERNET_MAC_MACA3HR_ADDRHI_0                                   (0x1U<<0)

// MACA3LR Configuration

#define ETHERNET_MAC_MACA3LR_ADDRLO                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACA3LR_ADDRLO_0                                   (0x1U<<0)

// MMC_CONTROL Configuration

#define ETHERNET_MAC_MMC_CONTROL_UCDBC                                  (0x1U<<8)
#define ETHERNET_MAC_MMC_CONTROL_CNTPRSTLVL                             (0x1U<<5)
#define ETHERNET_MAC_MMC_CONTROL_CNTPRST                                (0x1U<<4)
#define ETHERNET_MAC_MMC_CONTROL_CNTFREEZ                               (0x1U<<3)
#define ETHERNET_MAC_MMC_CONTROL_RSTONRD                                (0x1U<<2)
#define ETHERNET_MAC_MMC_CONTROL_CNTSTOPRO                              (0x1U<<1)
#define ETHERNET_MAC_MMC_CONTROL_CNTRST                                 (0x1U<<0)

// MMC_RX_INTERRUPT Configuration

#define ETHERNET_MAC_MMC_RX_INTERRUPT_RXLPITRCIS                        (0x1U<<27)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_RXLPIUSCIS                        (0x1U<<26)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_RXUCGPIS                          (0x1U<<17)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_RXALGNERPIS                       (0x1U<<6)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_RXCRCERPIS                        (0x1U<<5)

// MMC_TX_INTERRUPT Configuration

#define ETHERNET_MAC_MMC_TX_INTERRUPT_TXLPITRCIS                        (0x1U<<27)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_TXLPIUSCIS                        (0x1U<<26)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_TXGPKTIS                          (0x1U<<21)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_TXMCOLGPIS                        (0x1U<<15)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_TXSCOLGPIS                        (0x1U<<14)

// MMC_RX_INTERRUPT_MASK Configuration

#define ETHERNET_MAC_MMC_RX_INTERRUPT_MASK_RXLPITRCIM                   (0x1U<<27)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM                   (0x1U<<26)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_MASK_RXUCGPIM                     (0x1U<<17)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM                  (0x1U<<6)
#define ETHERNET_MAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM                   (0x1U<<5)

// MMC_TX_INTERRUPT_MASK Configuration

#define ETHERNET_MAC_MMC_TX_INTERRUPT_MASK_TXLPITRCIM                   (0x1U<<27)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM                   (0x1U<<26)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM                     (0x1U<<21)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM                   (0x1U<<15)
#define ETHERNET_MAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM                   (0x1U<<14)

// TX_SINGLE_COLLISION_GOOD_PACKETS Configuration

#define ETHERNET_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG        (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_0      (0x1U<<0)

// TX_MULTIPLE_COLLISION_GOOD_PACKETS Configuration

#define ETHERNET_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG      (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_0    (0x1U<<0)

// TX_PACKET_COUNT_GOOD Configuration

#define ETHERNET_MAC_TX_PACKET_COUNT_GOOD_TXPKTG                        (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_TX_PACKET_COUNT_GOOD_TXPKTG_0                      (0x1U<<0)

// RX_CRC_ERROR_PACKETS Configuration

#define ETHERNET_MAC_RX_CRC_ERROR_PACKETS_RXCRCERR                      (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_RX_CRC_ERROR_PACKETS_RXCRCERR_0                    (0x1U<<0)

// RX_ALIGNMENT_ERROR_PACKETS Configuration

#define ETHERNET_MAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR               (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_0             (0x1U<<0)

// RX_UNICAST_PACKETS_GOOD Configuration

#define ETHERNET_MAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG                   (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_0                 (0x1U<<0)

// TX_LPI_USEC_CNTR Configuration

