Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_ethernet_mac.h
#define ETHERNET_MAC_TX_LPI_USEC_CNTR_TXLPIUSC                          (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_TX_LPI_USEC_CNTR_TXLPIUSC_0                        (0x1U<<0)

// TX_LPI_TRAN_CNTR Configuration

#define ETHERNET_MAC_TX_LPI_TRAN_CNTR_TXLPITRC                          (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_TX_LPI_TRAN_CNTR_TXLPITRC_0                        (0x1U<<0)

// RX_LPI_USEC_CNTR Configuration

#define ETHERNET_MAC_RX_LPI_USEC_CNTR_RXLPIUSC                          (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_RX_LPI_USEC_CNTR_RXLPIUSC_0                        (0x1U<<0)

// RX_LPI_TRAN_CNTR Configuration

#define ETHERNET_MAC_RX_LPI_TRAN_CNTR_RXLPITRC                          (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_RX_LPI_TRAN_CNTR_RXLPITRC_0                        (0x1U<<0)

// MACL3L4C0R Configuration

#define ETHERNET_MAC_MACL3L4C0R_L4DPIM0                                 (0x1U<<21)
#define ETHERNET_MAC_MACL3L4C0R_L4DPM0                                  (0x1U<<20)
#define ETHERNET_MAC_MACL3L4C0R_L4SPIM0                                 (0x1U<<19)
#define ETHERNET_MAC_MACL3L4C0R_L4SPM0                                  (0x1U<<18)
#define ETHERNET_MAC_MACL3L4C0R_L4PEN0                                  (0x1U<<16)
#define ETHERNET_MAC_MACL3L4C0R_L3HDBM0                                 (0x1FU<<11)
#define ETHERNET_MAC_MACL3L4C0R_L3HDBM0_0                               (0x1U<<11)
#define ETHERNET_MAC_MACL3L4C0R_L3HSBM0                                 (0x1FU<<6)
#define ETHERNET_MAC_MACL3L4C0R_L3HSBM0_0                               (0x1U<<6)
#define ETHERNET_MAC_MACL3L4C0R_L3DAIM0                                 (0x1U<<5)
#define ETHERNET_MAC_MACL3L4C0R_L3DAM0                                  (0x1U<<4)
#define ETHERNET_MAC_MACL3L4C0R_L3SAIM0                                 (0x1U<<3)
#define ETHERNET_MAC_MACL3L4C0R_L3SAM0                                  (0x1U<<2)
#define ETHERNET_MAC_MACL3L4C0R_L3PEN0                                  (0x1U<<0)

// MACL4A0R Configuration

#define ETHERNET_MAC_MACL4A0R_L4DP0                                     (0xFFFFU<<16)
#define ETHERNET_MAC_MACL4A0R_L4DP0_0                                   (0x1U<<16)
#define ETHERNET_MAC_MACL4A0R_L4SP0                                     (0xFFFFU<<0)
#define ETHERNET_MAC_MACL4A0R_L4SP0_0                                   (0x1U<<0)

// MACL3A00R Configuration

#define ETHERNET_MAC_MACL3A00R_L3A00                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A00R_L3A00_0                                  (0x1U<<0)

// MACL3A10R Configuration

#define ETHERNET_MAC_MACL3A10R_L3A10                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A10R_L3A10_0                                  (0x1U<<0)

// MACL3A20 Configuration

#define ETHERNET_MAC_MACL3A20_L3A20                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A20_L3A20_0                                   (0x1U<<0)

// MACL3A30 Configuration

#define ETHERNET_MAC_MACL3A30_L3A30                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A30_L3A30_0                                   (0x1U<<0)

// MACL3L4C1R Configuration

#define ETHERNET_MAC_MACL3L4C1R_L4DPIM1                                 (0x1U<<21)
#define ETHERNET_MAC_MACL3L4C1R_L4DPM1                                  (0x1U<<20)
#define ETHERNET_MAC_MACL3L4C1R_L4SPIM1                                 (0x1U<<19)
#define ETHERNET_MAC_MACL3L4C1R_L4SPM1                                  (0x1U<<18)
#define ETHERNET_MAC_MACL3L4C1R_L4PEN1                                  (0x1U<<16)
#define ETHERNET_MAC_MACL3L4C1R_L3HDBM1                                 (0x1FU<<11)
#define ETHERNET_MAC_MACL3L4C1R_L3HDBM1_0                               (0x1U<<11)
#define ETHERNET_MAC_MACL3L4C1R_L3HSBM1                                 (0x1FU<<6)
#define ETHERNET_MAC_MACL3L4C1R_L3HSBM1_0                               (0x1U<<6)
#define ETHERNET_MAC_MACL3L4C1R_L3DAIM1                                 (0x1U<<5)
#define ETHERNET_MAC_MACL3L4C1R_L3DAM1                                  (0x1U<<4)
#define ETHERNET_MAC_MACL3L4C1R_L3SAIM1                                 (0x1U<<3)
#define ETHERNET_MAC_MACL3L4C1R_L3SAM1                                  (0x1U<<2)
#define ETHERNET_MAC_MACL3L4C1R_L3PEN1                                  (0x1U<<0)

// MACL4A1R Configuration

#define ETHERNET_MAC_MACL4A1R_L4DP1                                     (0xFFFFU<<16)
#define ETHERNET_MAC_MACL4A1R_L4DP1_0                                   (0x1U<<16)
#define ETHERNET_MAC_MACL4A1R_L4SP1                                     (0xFFFFU<<0)
#define ETHERNET_MAC_MACL4A1R_L4SP1_0                                   (0x1U<<0)

// MACL3A01R Configuration

#define ETHERNET_MAC_MACL3A01R_L3A01                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A01R_L3A01_0                                  (0x1U<<0)

// MACL3A11R Configuration

#define ETHERNET_MAC_MACL3A11R_L3A11                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A11R_L3A11_0                                  (0x1U<<0)

// MACL3A21R Configuration

#define ETHERNET_MAC_MACL3A21R_L3A21                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A21R_L3A21_0                                  (0x1U<<0)

// MACL3A31R Configuration

#define ETHERNET_MAC_MACL3A31R_L3A31                                    (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACL3A31R_L3A31_0                                  (0x1U<<0)

// MACARPAR Configuration

#define ETHERNET_MAC_MACARPAR_ARPPA                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACARPAR_ARPPA_0                                   (0x1U<<0)

// MACTSCR Configuration

#define ETHERNET_MAC_MACTSCR_TXTSSTSM                                   (0x1U<<24)
#define ETHERNET_MAC_MACTSCR_CSC                                        (0x1U<<19)
#define ETHERNET_MAC_MACTSCR_TSENMACADDR                                (0x1U<<18)
#define ETHERNET_MAC_MACTSCR_SNAPTYPSEL                                 (0x3U<<16)
#define ETHERNET_MAC_MACTSCR_SNAPTYPSEL_0                               (0x1U<<16)
#define ETHERNET_MAC_MACTSCR_TSMSTRENA                                  (0x1U<<15)
#define ETHERNET_MAC_MACTSCR_TSEVNTENA                                  (0x1U<<14)
#define ETHERNET_MAC_MACTSCR_TSIPV4ENA                                  (0x1U<<13)
#define ETHERNET_MAC_MACTSCR_TSIPV6ENA                                  (0x1U<<12)
#define ETHERNET_MAC_MACTSCR_TSIPENA                                    (0x1U<<11)
#define ETHERNET_MAC_MACTSCR_TSVER2ENA                                  (0x1U<<10)
#define ETHERNET_MAC_MACTSCR_TSCTRLSSR                                  (0x1U<<9)
#define ETHERNET_MAC_MACTSCR_TSENALL                                    (0x1U<<8)
#define ETHERNET_MAC_MACTSCR_TSADDREG                                   (0x1U<<5)
#define ETHERNET_MAC_MACTSCR_TSUPDT                                     (0x1U<<3)
#define ETHERNET_MAC_MACTSCR_TSINIT                                     (0x1U<<2)
#define ETHERNET_MAC_MACTSCR_TSCFUPDT                                   (0x1U<<1)
#define ETHERNET_MAC_MACTSCR_TSENA                                      (0x1U<<0)

// MACSSIR Configuration

#define ETHERNET_MAC_MACSSIR_SSINC                                      (0xFFU<<16)
#define ETHERNET_MAC_MACSSIR_SSINC_0                                    (0x1U<<16)
#define ETHERNET_MAC_MACSSIR_SNSINC                                     (0xFFU<<8)
#define ETHERNET_MAC_MACSSIR_SNSINC_0                                   (0x1U<<8)

// MACSTSR Configuration

#define ETHERNET_MAC_MACSTSR_TSS                                        (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACSTSR_TSS_0                                      (0x1U<<0)

// MACSTNR Configuration

#define ETHERNET_MAC_MACSTNR_TSSS                                       (0x7FFFFFFFU<<0)
#define ETHERNET_MAC_MACSTNR_TSSS_0                                     (0x1U<<0)

// MACSTSUR Configuration

