Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H743/Includes/Registers/stm32H743_ethernet_mac.h
#define ETHERNET_MAC_MACSTSUR_TSS                                       (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACSTSUR_TSS_0                                     (0x1U<<0)

// MACSTNUR Configuration

#define ETHERNET_MAC_MACSTNUR_ADDSUB                                    (0x1U<<31)
#define ETHERNET_MAC_MACSTNUR_TSSS                                      (0x7FFFFFFFU<<0)
#define ETHERNET_MAC_MACSTNUR_TSSS_0                                    (0x1U<<0)

// MACTSAR Configuration

#define ETHERNET_MAC_MACTSAR_TSAR                                       (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACTSAR_TSAR_0                                     (0x1U<<0)

// MACTSSR Configuration

#define ETHERNET_MAC_MACTSSR_ATSNS                                      (0x1FU<<25)
#define ETHERNET_MAC_MACTSSR_ATSNS_0                                    (0x1U<<25)
#define ETHERNET_MAC_MACTSSR_ATSSTM                                     (0x1U<<24)
#define ETHERNET_MAC_MACTSSR_ATSSTN                                     (0xFU<<16)
#define ETHERNET_MAC_MACTSSR_ATSSTN_0                                   (0x1U<<16)
#define ETHERNET_MAC_MACTSSR_TXTSSIS                                    (0x1U<<15)
#define ETHERNET_MAC_MACTSSR_TSTRGTERR0                                 (0x1U<<3)
#define ETHERNET_MAC_MACTSSR_AUXTSTRIG                                  (0x1U<<2)
#define ETHERNET_MAC_MACTSSR_TSTARGT0                                   (0x1U<<1)
#define ETHERNET_MAC_MACTSSR_TSSOVF                                     (0x1U<<0)

// MACTXTSSNR Configuration

#define ETHERNET_MAC_MACTXTSSNR_TXTSSMIS                                (0x1U<<31)
#define ETHERNET_MAC_MACTXTSSNR_TXTSSLO                                 (0x7FFFFFFFU<<0)
#define ETHERNET_MAC_MACTXTSSNR_TXTSSLO_0                               (0x1U<<0)

// MACTXTSSSR Configuration

#define ETHERNET_MAC_MACTXTSSSR_TXTSSHI                                 (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACTXTSSSR_TXTSSHI_0                               (0x1U<<0)

// MACACR Configuration

#define ETHERNET_MAC_MACACR_ATSEN3                                      (0x1U<<7)
#define ETHERNET_MAC_MACACR_ATSEN2                                      (0x1U<<6)
#define ETHERNET_MAC_MACACR_ATSEN1                                      (0x1U<<5)
#define ETHERNET_MAC_MACACR_ATSEN0                                      (0x1U<<4)
#define ETHERNET_MAC_MACACR_ATSFC                                       (0x1U<<0)

// MACATSNR Configuration

#define ETHERNET_MAC_MACATSNR_AUXTSLO                                   (0x7FFFFFFFU<<0)
#define ETHERNET_MAC_MACATSNR_AUXTSLO_0                                 (0x1U<<0)

// MACATSSR Configuration

#define ETHERNET_MAC_MACATSSR_AUXTSHI                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACATSSR_AUXTSHI_0                                 (0x1U<<0)

// MACTSIACR Configuration

#define ETHERNET_MAC_MACTSIACR_OSTIAC                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACTSIACR_OSTIAC_0                                 (0x1U<<0)

// MACTSEACR Configuration

#define ETHERNET_MAC_MACTSEACR_OSTEAC                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACTSEACR_OSTEAC_0                                 (0x1U<<0)

// MACTSICNR Configuration

#define ETHERNET_MAC_MACTSICNR_TSIC                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACTSICNR_TSIC_0                                   (0x1U<<0)

// MACTSECNR Configuration

#define ETHERNET_MAC_MACTSECNR_TSEC                                     (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACTSECNR_TSEC_0                                   (0x1U<<0)

// MACPPSCR Configuration

#define ETHERNET_MAC_MACPPSCR_TRGTMODSEL0                               (0x3U<<5)
#define ETHERNET_MAC_MACPPSCR_TRGTMODSEL0_0                             (0x1U<<5)
#define ETHERNET_MAC_MACPPSCR_PPSEN0                                    (0x1U<<4)
#define ETHERNET_MAC_MACPPSCR_PPSCTRL                                   (0xFU<<0)
#define ETHERNET_MAC_MACPPSCR_PPSCTRL_0                                 (0x1U<<0)

// MACPPSTTSR Configuration

#define ETHERNET_MAC_MACPPSTTSR_TSTRH0                                  (0x7FFFFFFFU<<0)
#define ETHERNET_MAC_MACPPSTTSR_TSTRH0_0                                (0x1U<<0)

// MACPPSTTNR Configuration

#define ETHERNET_MAC_MACPPSTTNR_TRGTBUSY0                               (0x1U<<31)
#define ETHERNET_MAC_MACPPSTTNR_TTSL0                                   (0x7FFFFFFFU<<0)
#define ETHERNET_MAC_MACPPSTTNR_TTSL0_0                                 (0x1U<<0)

// MACPPSIR Configuration

#define ETHERNET_MAC_MACPPSIR_PPSINT0                                   (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACPPSIR_PPSINT0_0                                 (0x1U<<0)

// MACPPSWR Configuration

#define ETHERNET_MAC_MACPPSWR_PPSWIDTH0                                 (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACPPSWR_PPSWIDTH0_0                               (0x1U<<0)

// MACPOCR Configuration

#define ETHERNET_MAC_MACPOCR_DN                                         (0xFFU<<8)
#define ETHERNET_MAC_MACPOCR_DN_0                                       (0x1U<<8)
#define ETHERNET_MAC_MACPOCR_DRRDIS                                     (0x1U<<6)
#define ETHERNET_MAC_MACPOCR_APDREQTRIG                                 (0x1U<<5)
#define ETHERNET_MAC_MACPOCR_ASYNCTRIG                                  (0x1U<<4)
#define ETHERNET_MAC_MACPOCR_APDREQEN                                   (0x1U<<2)
#define ETHERNET_MAC_MACPOCR_ASYNCEN                                    (0x1U<<1)
#define ETHERNET_MAC_MACPOCR_PTOEN                                      (0x1U<<0)

// MACSPI0R Configuration

#define ETHERNET_MAC_MACSPI0R_SPI0                                      (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACSPI0R_SPI0_0                                    (0x1U<<0)

// MACSPI1R Configuration

#define ETHERNET_MAC_MACSPI1R_SPI1                                      (0xFFFFFFFFU<<0)
#define ETHERNET_MAC_MACSPI1R_SPI1_0                                    (0x1U<<0)

// MACSPI2R Configuration

#define ETHERNET_MAC_MACSPI2R_SPI2                                      (0xFFFFU<<0)
#define ETHERNET_MAC_MACSPI2R_SPI2_0                                    (0x1U<<0)

// MACLMIR Configuration

#define ETHERNET_MAC_MACLMIR_LMPDRI                                     (0xFFU<<24)
#define ETHERNET_MAC_MACLMIR_LMPDRI_0                                   (0x1U<<24)
#define ETHERNET_MAC_MACLMIR_DRSYNCR                                    (0x7U<<8)
#define ETHERNET_MAC_MACLMIR_DRSYNCR_0                                  (0x1U<<8)
#define ETHERNET_MAC_MACLMIR_LSI                                        (0xFFU<<0)
#define ETHERNET_MAC_MACLMIR_LSI_0                                      (0x1U<<0)
